Repository: giellalt/corpus-nob
Catalog: stable/tmx/sme/science/uit/phd/margrethe_bals.pdf.tmx
Source language: nob
Languages: sme

source: Denne avhandlingen undersøker felles og kulturspesifikke risiko- og beskyttelsesfaktorer for internaliseringsvansker (angst- og depresjonssymptomer) hos samiske og ikke-samiske ungdom.
sme: Dát nákkusgirji iská internaliserenváttuid (váttut baluin ja lossa mielain) oktasaš ja kultuvrralaš riska- ja gáhttenfáktoriid sámi ja eará nuorain.

source: Dette er en tverrsnittstudie, og data er hentet fra ungdomsundersøkelsen ”Ungdom og Helse” som ble gjennomført blant 10 klassingene i ungdomskolene i Nord Norge i 20032005. Utvalget består av 4449 ungdom der 450 (10 %) var samer 3999 (90 %) var ikke-samer.
sme: Dá lea jearahallaniskkadeapmi, ja data lea vižžon nuoraid dearvvašvuođaiskkadeamis mii čađahuvvui buot 10. luohkáin davvi Norgga nuoraidskuvllain jagiid 2003-2005. Dan iskkadeapmái serve 4449 nuora, ja sis ledje 450 (10 %) sámi nuorat ja 3999 (90 %) ges eará nuorat.

source: Funnene fra avhandlingen viste følgende: (1) Det var ingen forskjeller mellom samer og ikkesamer på symptomnivå i internaliseringsvansker;
sme: Nákkusgirjjis ledje čuovvovaš bohtosat: (1) Sámi ja eará nuorain eai lean erohusat internaliserenváttuin;

source: (2) Sterk etnisk identitet, etnisk diskriminering og tap av samisk språk viste seg å være kulturelle risikofaktorer assosiert med økende grad av internaliseringssymptomer;
sme: (2) Nanu etnalaš identitehta, etnalaš vealaheapmi ja sámegiela massin ledje kultuvrralaš riskafáktorat mat ledje čadnon internaliserenváttuid lassáneapmái;

source: (3) I en familiesosialiserings kontekst, var det mest likheter, men også noen kulturelle forskjeller i hvilke familiefaktorer som var assosiert med internaliseringssymptomer;
sme: (3) Čájehuvvui ahte bearaškonteavsttas ledje ollu seammaláganvuođat, muhto maiddai kultuvrralaš erohusat das makkár bearašfáktorat ledje čadnon internaliserenváttuide;

source: (4) Å delta i kulturelle aktiviteter og etnisk stolthet var identifisert som kulturelle beskyttelsesfaktorer og hadde sammenheng med reduksjon av symptomer;
sme: (4) Searvat kultuvrralaš doaimmaide ja leat rámis iežas etnalaš joavkkuin ledje kultuvrralaš gáhttenfáktorat mat ledje čadnon váttuid njiedjamii;

source: (5) Kjønnsforskjeller ble avdekket i begge etniske grupper både når det gjaldt symptomnivå og også i hvilke risiko og beskyttelsesfaktorer som var assosiert med symptomer;
sme: (5) Sohkabealerohusat gávdnojedje goappaš etnalaš joavkkuin, sihke dan ektui man ollu váttut ledje ja makkár fáktorat ledje čadnon váttuide;

source: (6) Felles beskyttelsesfaktorer, som for eksempel tro på egen mestring, ser ut til å forsterke effekten av kulturelle beskyttelsesfaktorer.
sme: (6) Obbalaš gáhttenfáktorat, nugo buorre iešdovdu, orrot nanneme kultuvrralaš gáhttenfáktoriid ávkki.

source: Funnene fra avhandlingen indikerer både likheter og forskjeller hos samer og ikke-samer når det gjelder internaliseringssymptomer, samt at det også viser at de unike erfaringene urfolksungdom har, er relatert til angst- og depresjonssymptomer.
sme: Nákkusgirjji bohtosat čájehit sihke seammaláganvuođaid ja erohusaid internaliserenváttuin sámi ja eará nuoraid gaskkas. Bohtosat čájehit dasa lassin ahte leat álgoálbmot nuorran lea maiddái čadnon ballui ja lossa millii.

source: Integreringen av kulturelle beskyttelsesfaktorer sammen med de mer generelle beskyttelsesfaktorene er viktig når fokuset er psykiske plager og utvikling hos ungdom.
sme: Lea dehálaš váldit vuhtii sihke oktasaš ja kultuvrralaš gáhttenfáktoriid go iská nuoraid psyhkalaš váttisvuođaid ja ovdáneami.
